#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bcgov/uux0vy-dev/runs/run-P9SxgekPXUD2qBPh

Waiting for the plan to start...

Terraform v1.1.4
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
tls_private_key.private_key: Refreshing state... [id=93189a6e1018f93458f245bce5913f7380af26c8]
aws_cloudwatch_log_group.api_gateway: Refreshing state... [id=api-gw/ien-dev-api/logs]
aws_ssm_parameter.public_key_ssm_param: Refreshing state... [id=/ien-dev/public-key]
aws_ssm_parameter.public_key_openssh_ssm_param: Refreshing state... [id=/ien-dev/public-key-openssh]
aws_s3_bucket.app: Refreshing state... [id=ien-dev-app]
aws_apigatewayv2_api.api: Refreshing state... [id=h42aam618b]
aws_key_pair.key_pair: Refreshing state... [id=ien-dev-key]
aws_cloudfront_origin_access_identity.app: Refreshing state... [id=E2IVILJXHTCWXZ]
aws_iam_role.lambda: Refreshing state... [id=ien-dev-lambda]
aws_iam_instance_profile.ec2_instance_profile: Refreshing state... [id=ien-dev-ec2-role]
aws_ssm_parameter.private_key_ssm_param: Refreshing state... [id=/ien-dev/private-key]
aws_cloudfront_function.request: Refreshing state... [id=ien-dev-cf-request]
aws_cloudfront_function.response: Refreshing state... [id=ien-dev-cf-response]
aws_apigatewayv2_stage.api: Refreshing state... [id=$default]
aws_iam_role_policy_attachment.lambda_execute: Refreshing state... [id=ien-dev-lambda-20220401150128751600000005]
aws_iam_role_policy_attachment.lambda_sqs: Refreshing state... [id=ien-dev-lambda-20220401150128718800000002]
aws_iam_role_policy_attachment.lambda_s3: Refreshing state... [id=ien-dev-lambda-20220401150128719700000003]
aws_iam_role_policy_attachment.lambda_vpc: Refreshing state... [id=ien-dev-lambda-20220401150128716700000001]
aws_iam_role_policy_attachment.lambda_cloudwatch: Refreshing state... [id=ien-dev-lambda-20220401150128722800000004]
aws_db_subnet_group.pgsql: Refreshing state... [id=pgsql]
aws_rds_cluster.pgsql: Refreshing state... [id=ien-dev-db]
aws_s3_bucket_policy.app: Refreshing state... [id=ien-dev-app]
aws_cloudfront_distribution.app: Refreshing state... [id=EM85EBT6QA4PS]
aws_instance.bastion_instance: Refreshing state... [id=i-05e4357923a54e6e4]
aws_lambda_function.api: Refreshing state... [id=ien-dev-api]
aws_rds_cluster_instance.pgsql[0]: Refreshing state... [id=ien-dev-db-0]
aws_apigatewayv2_integration.api: Refreshing state... [id=d0ksdj8]
aws_lambda_permission.api_allow_gateway: Refreshing state... [id=terraform-20220401150623852600000001]
aws_apigatewayv2_route.api: Refreshing state... [id=jkgaazn]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_lambda_function.api has changed
  ~ resource "aws_lambda_function" "api" {
        id                             = "ien-dev-api"
      ~ last_modified                  = "2022-04-20T20:39:17.000+0000" -> "2022-04-20T20:41:51.000+0000"
      ~ source_code_hash               = "eXiobXRAVOxI+ZD2l7659HWusIV6KF+sZWGdBr6KpKM=" -> "Dlj48qstgIH3HoB19V8rvhGN+UUQ5a+0pYOYbkoNZUs="
      ~ source_code_size               = 49017391 -> 49017433
        tags                           = {}
        # (22 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.hmbc_to_ien_applicants will be created
  + resource "aws_cloudwatch_event_rule" "hmbc_to_ien_applicants" {
      + arn                 = (known after apply)
      + description         = "8:00AM UTC - 1:00AM PST"
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "ien-dev-hmbc-to-ien-applicants"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 8 * * ? *)"
      + tags_all            = (known after apply)
    }

  # aws_cloudwatch_event_rule.hmbc_to_ien_masters will be created
  + resource "aws_cloudwatch_event_rule" "hmbc_to_ien_masters" {
      + arn                 = (known after apply)
      + description         = "7:00AM UTC - 12:00AM PST"
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "ien-dev-hmbc-to-ien-masters"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 7 * * ? *)"
      + tags_all            = (known after apply)
    }

  # aws_cloudwatch_event_target.hmbc_to_ien_applicants will be created
  + resource "aws_cloudwatch_event_target" "hmbc_to_ien_applicants" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + input          = jsonencode(
            {
              + path = "applicant-data"
            }
        )
      + rule           = "ien-dev-hmbc-to-ien-applicants"
      + target_id      = (known after apply)
    }

  # aws_cloudwatch_event_target.hmbc_to_ien_masters will be created
  + resource "aws_cloudwatch_event_target" "hmbc_to_ien_masters" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + input          = jsonencode(
            {
              + path = "master-data"
            }
        )
      + rule           = "ien-dev-hmbc-to-ien-masters"
      + target_id      = (known after apply)
    }

  # aws_lambda_function.SyncApplicants will be created
  + resource "aws_lambda_function" "SyncApplicants" {
      + arn                            = (known after apply)
      + description                    = "Trigger Sync applicant and master data service"
      + filename                       = "./build/empty_lambda.zip"
      + function_name                  = "ien-dev-syncdata"
      + handler                        = "api/syncdata.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 2048
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::588188670678:role/ien-dev-lambda"
      + runtime                        = "nodejs14.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "0XCcYIn0+jTjUwxPorWwPN2f8zZKRGEzZOOQyWVxIQw="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 300
      + version                        = (known after apply)

      + environment {}

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0a37263c5e776d030",
            ]
          + subnet_ids         = [
              + "subnet-048e25be105ae01d3",
              + "subnet-0896ff158c3ecdc53",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # aws_lambda_function.api will be updated in-place
  ~ resource "aws_lambda_function" "api" {
        id                             = "ien-dev-api"
        tags                           = {}
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "BUILD_ID"          = "d2813e3" -> "3f7a95e"
              ~ "BUILD_INFO"        = "d2813e3, GitHub, IEN-222-remove-dynamic-routing-64, grafted, HEAD, tag: refs/tags/dev" -> "3f7a95e, GitHub, Merge-9114c3942118846225cf90793949bac555f4e4dc-into-d2813e33fcc68e5137b1cf37b70f496f998db3d3, grafted, HEAD, refs/remotes/pull/65/merge"
                # (12 unchanged elements hidden)
            }
        }


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_permission.hmbc_to_ien_applicants will be created
  + resource "aws_lambda_permission" "hmbc_to_ien_applicants" {
      + action        = "lambda:InvokeFunction"
      + function_name = "ien-dev-syncdata"
      + id            = (known after apply)
      + principal     = "events.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromCloudWatch_Morning"
    }

  # aws_lambda_permission.hmbc_to_ien_masters will be created
  + resource "aws_lambda_permission" "hmbc_to_ien_masters" {
      + action        = "lambda:InvokeFunction"
      + function_name = "ien-dev-syncdata"
      + id            = (known after apply)
      + principal     = "events.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromCloudWatch_Morning"
    }

Plan: 7 to add, 1 to change, 0 to destroy.


------------------------------------------------------------------------

Cost estimation:

Resources: 2 of 9 estimated
           $226.3600000000000008/mo +$0.0

```

</details>